Конфигурация/DataProcessors/ПечатьСпискаАналогичныхЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьСпискаАналогичныхЦенныхБумаг</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛицАнкетные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛицАнкетные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КППКрупнейшегоНалогоплательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КИО</Name>
					<Comment>Код иностранной организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факсы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСтраница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентПо173ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоНахождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВТорговыхСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКодовВТорговыхСистемах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/DataProcessors/ПечатьСпискаАналогичныхЦенныхБумаг/Ext/ObjectModule.bsl
Функция СформироватьПечатнуюФормуСпискаАналогов(Клиент, Организация, Период, ЦеннаяБумага = Неопределено, Получатель = Неопределено, Подписант = Неопределено) Экспорт
	
	ДатаФормирования = ТекущаяДатаСеанса();
	
	Макет = ПолучитьМакет("МакетПисьма");	
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	// Шапка
	
	ДокументРезультат.Вывести(РаботаСОтчетами.ПолучитьШапкуОфициальногоБланкаОрганизации(Организация, ДатаФормирования));
	
	// Реквизиты письма
	
	КраткоеНаименованиеПолучателя = Получатель;
	
	Если ЗначениеЗаполнено(Получатель) Тогда
		
		#Область Получение_реквизитов_получателя

		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетные.КраткоеНаименованиеПоУставу, ЕСТЬNULL(РеквизитыФизическихЛицАнкетные.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетные.Имя, 1, 1) + ""."" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетные.Отчество, 1, 1) + ""."", ЕСТЬNULL(РеквизитыЮридическихЛиц.КраткоеНаименованиеПоУставу, ЕСТЬNULL(РеквизитыСотрудниковОрганизации.Фамилия + "" "" + ПОДСТРОКА(РеквизитыСотрудниковОрганизации.Имя, 1, 1) + ""."" + ПОДСТРОКА(РеквизитыСотрудниковОрганизации.Отчество, 1, 1) + ""."", ЮрФизЛица.Наименование)))) КАК КраткоеНаименование
			|ИЗ
			|	Справочник.ЮрФизЛица КАК ЮрФизЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И ЮрФизЛицо = &Получатель
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетные
			|		ПО (РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо = ЮрФизЛица.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И ЮрФизЛицо = &Получатель
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетные
			|		ПО (РеквизитыФизическихЛицАнкетные.ЮрФизЛицо = ЮрФизЛица.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&Период,
			|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|					И ЮрФизЛицо = &Получатель
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛиц
			|		ПО (РеквизитыЮридическихЛиц.ЮрФизЛицо = ЮрФизЛица.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И ЮрФизЛицо = &Получатель
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыСотрудниковОрганизации
			|		ПО (РеквизитыСотрудниковОрганизации.ЮрФизЛицо = ЮрФизЛица.Ссылка)
			|ГДЕ
			|	ЮрФизЛица.Ссылка = &Получатель");
		
		Запрос.УстановитьПараметр("Период",		 ДатаФормирования);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Получатель",	 Получатель);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			КраткоеНаименованиеПолучателя = РезультатЗапроса.Выгрузить()[0].КраткоеНаименование;
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КраткоеНаименованиеПолучателя) Тогда
		КраткоеНаименованиеПолучателя = "___________________"
	КонецЕсли;
	
	ОбластьРеквизитыПисьма = Макет.ПолучитьОбласть("РеквизитыПисьма");
	ОбластьРеквизитыПисьма.Параметры.РеквизитыПисьма = СтрШаблон("№ %1-1 от %2г", Формат(ДатаФормирования, "ДФ=ddMMyy"), Формат(ДатаФормирования, "ДФ=dd.MM.yyyy"));
	ОбластьРеквизитыПисьма.Параметры.Получатель		 = КраткоеНаименованиеПолучателя;	
	
	ДокументРезультат.Вывести(ОбластьРеквизитыПисьма);
	
	// Текст письма
	
	КраткоеНаименованиеКлиента = Клиент;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		
		#Область Получение_реквизитов_клиента

		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетные.КраткоеНаименованиеПоУставу,
			|		ЕСТЬNULL(РеквизитыФизическихЛицАнкетные.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетные.Имя, 1, 1) + ""."" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетные.Отчество, 1, 1) + ""."",
			|			ЮрФизЛица.Наименование)) КАК КраткоеНаименование
			|ИЗ
			|	Справочник.ЮрФизЛица КАК ЮрФизЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И ЮрФизЛицо = &Клиент
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетные
			|		ПО (РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо = ЮрФизЛица.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И ЮрФизЛицо = &Клиент
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетные
			|		ПО (РеквизитыФизическихЛицАнкетные.ЮрФизЛицо = ЮрФизЛица.Ссылка)
			|ГДЕ
			|	ЮрФизЛица.Ссылка = &Клиент");
		
		Запрос.УстановитьПараметр("Период",		 ДатаФормирования);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Клиент",		 Клиент);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			КраткоеНаименованиеПолучателя = РезультатЗапроса.Выгрузить()[0].КраткоеНаименование;
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	ОбластьТекстПисьма = Макет.ПолучитьОбласть("ТекстПисьма");
	ОбластьТекстПисьма.Параметры.ДатаОценки					= Формат(Период, "ДФ=dd.MM.yyyy");
	ОбластьТекстПисьма.Параметры.КраткоеНаименованиеКлиента	= КраткоеНаименованиеКлиента;
	
	ДокументРезультат.Вывести(ОбластьТекстПисьма);
	
	// Тело
	
	#Область Запрос_зарегистрированных_аналогов
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РаботаСЦеннымиБумагами.ПолучитьЦенныеБумагиКлиента(Клиент, Организация, КонецДня(Период), , , Истина, Истина, "_ЦенныеБумагиКлиента", Запрос.МенеджерВременныхТаблиц);
	
	ФильтрПоБумаге = ?(ЗначениеЗаполнено(ЦеннаяБумага), ЦеннаяБумага, Неопределено);
	
	РаботаСПереоценкой.ПоместитьАналогиЦенныхБумагВМенеджерВременныхТаблиц(Запрос, ФильтрПоБумаге, Период, Организация, Клиент, , "_ЗарегистрированныеАналоги"); 
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА _ЦенныеБумагиКлиента.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ""Для пенсионных резервов""
		|		КОГДА _ЦенныеБумагиКлиента.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ""Для пенсионных накоплений""
		|		ИНАЧЕ _ЦенныеБумагиКлиента.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления
		|	КОНЕЦ КАК ВидДоговораДУ,
		|	ВЫБОР
		|		КОГДА _ЦенныеБумагиКлиента.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА """"
		|		КОГДА _ЦенныеБумагиКлиента.СчетДоверительногоУправления.Наименование ПОДОБНО ""% РОПС %""
		|			ТОГДА ""РОПС""
		|		КОГДА _ЦенныеБумагиКлиента.СчетДоверительногоУправления.Наименование ПОДОБНО ""% СВ %""
		|			ТОГДА ""СВ""
		|		КОГДА _ЦенныеБумагиКлиента.СчетДоверительногоУправления.Наименование ПОДОБНО ""% ВР %""
		|			ТОГДА ""ВР""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидПенсионныхНакопленийНПФ,
		|	_ЦенныеБумагиКлиента.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(РеквизитыЭмитента.СокращенноеНаименование + "", "" + Облигация.ГосударственныйРегистрационныйНомер, _ЦенныеБумагиКлиента.ЦеннаяБумага.Эмитент.Наименование + "", "" + _ЦенныеБумагиКлиента.ЦеннаяБумага.ГосударственныйРегистрационныйНомер) + ЕСТЬNULL("", "" + КодыISIN.Код, """") КАК ЦеннаяБумага,
		|	ЕСТЬNULL(РеквизитыЭмитентаАналога.СокращенноеНаименование + "", "" + АналогичнаяОблигация.ГосударственныйРегистрационныйНомер, _ЗарегистрированныеАналоги.Аналог.Эмитент.Наименование + "", "" + _ЗарегистрированныеАналоги.Аналог.ГосударственныйРегистрационныйНомер) + ЕСТЬNULL("", "" + КодыISINАналогов.Код, """") КАК АналогичнаяЦеннаяБумага
		|ИЗ
		|	_ЦенныеБумагиКлиента КАК _ЦенныеБумагиКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗарегистрированныеАналоги КАК _ЗарегистрированныеАналоги
		|		ПО (_ЗарегистрированныеАналоги.ЦеннаяБумага = _ЦенныеБумагиКлиента.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигация
		|		ПО (Облигация.Ссылка = _ЦенныеБумагиКлиента.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК АналогичнаяОблигация
		|		ПО (АналогичнаяОблигация.Ссылка = _ЗарегистрированныеАналоги.Аналог)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЦелейРасчета.СрезПоследних(
		|				&Период,
		|				(Организация, СчетДоверительногоУправления, ЦельРасчета) В
		|					(ВЫБРАТЬ
		|						&Организация,
		|						_СчетаДоверительногоУправленияКлиента.СчетДоверительногоУправления,
		|						ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|					ИЗ
		|						_СчетаДоверительногоУправленияКлиента)) КАК НастройкиОценкиОбъектовВУправлении
		|		ПО (НастройкиОценкиОбъектовВУправлении.СчетДоверительногоУправления = _ЦенныеБумагиКлиента.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|				&Период,
		|				(Объект, ВидКода) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ЦенныеБумагиКлиента.ЦеннаяБумага,
		|						ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
		|					ИЗ
		|						_ЦенныеБумагиКлиента)) КАК КодыISIN
		|		ПО (КодыISIN.Объект = _ЦенныеБумагиКлиента.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|				&Период,
		|				(Объект, ВидКода) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ЗарегистрированныеАналоги.Аналог,
		|						ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
		|					ИЗ
		|						_ЗарегистрированныеАналоги)) КАК КодыISINАналогов
		|		ПО (КодыISINАналогов.Объект = _ЗарегистрированныеАналоги.Аналог)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитента
		|		ПО (Облигация.Эмитент.ЮрФизЛицо = РеквизитыЭмитента.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитентаАналога
		|		ПО (АналогичнаяОблигация.Эмитент.ЮрФизЛицо = РеквизитыЭмитентаАналога.ЮрФизЛицо)
		|ГДЕ
		|	ЕСТЬNULL(НЕ НастройкиОценкиОбъектовВУправлении.ВариантРасчетаОценочнойСтоимости В (&МетодикиБезАналогов), ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидДоговораДУ,
		|	ВидПенсионныхНакопленийНПФ,
		|	ЦеннаяБумага,
		|	АналогичнаяЦеннаяБумага
		|ИТОГИ ПО
		|	ВидДоговораДУ,
		|	ВидПенсионныхНакопленийНПФ,
		|	ЦеннаяБумага
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	#КонецОбласти
	
	МетодикиБезАналогов = Новый Массив;
	МетодикиБезАналогов.Добавить(Справочники.ВариантыРасчетаОценочнойСтоимости.РЭМ);
	МетодикиБезАналогов.Добавить(Справочники.ВариантыРасчетаОценочнойСтоимости.ФондФилософии);
	МетодикиБезАналогов.Добавить(Справочники.ВариантыРасчетаОценочнойСтоимости.ФОГФ);
	
	Запрос.УстановитьПараметр("Период",					Период);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("МетодикиБезАналогов",	МетодикиБезАналогов);
	
	ОбластьГруппаПортфелей	= Макет.ПолучитьОбласть("ГруппаПортфелей");
	ОбластьШапкаАналогов	= Макет.ПолучитьОбласть("ШапкаАналогов");
	ОбластьСтрокаАналогов	= Макет.ПолучитьОбласть("СтрокаАналогов");
	
	ВыборкаПоВидуДоговора = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоВидуДоговора.Следующий() Цикл
		
		ВыборкаПоВидуПенсионныхНакопленийНПФ = ВыборкаПоВидуДоговора.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВидуПенсионныхНакопленийНПФ.Следующий() Цикл
			
			ОбластьГруппаПортфелей.Параметры.ГруппаПортфелей = Строка(ВыборкаПоВидуДоговора.ВидДоговораДУ) + ?(ЗначениеЗаполнено(ВыборкаПоВидуПенсионныхНакопленийНПФ.ВидПенсионныхНакопленийНПФ), " (" + ВыборкаПоВидуПенсионныхНакопленийНПФ.ВидПенсионныхНакопленийНПФ + ")", "") + ":"; 
			
			ДокументРезультат.Вывести(ОбластьГруппаПортфелей);
			ДокументРезультат.Вывести(ОбластьШапкаАналогов);
			
			ВыборкаПоЦеннойБумаге = ВыборкаПоВидуПенсионныхНакопленийНПФ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоЦеннойБумаге.Следующий() Цикл
				
				АналогиЦеннойБумаги = Новый Массив;
				
				ВыборкаПоАналогам = ВыборкаПоЦеннойБумаге.Выбрать();
				Пока ВыборкаПоАналогам.Следующий() Цикл
					АналогиЦеннойБумаги.Добавить(ВыборкаПоАналогам.АналогичнаяЦеннаяБумага);		
				КонецЦикла;
				
				ОбластьСтрокаАналогов.Параметры.ЦеннаяБумага			= ВыборкаПоЦеннойБумаге.ЦеннаяБумага;
				ОбластьСтрокаАналогов.Параметры.АналогичнаяЦеннаяБумага	= СтрСоединить(АналогиЦеннойБумаги, Символы.ПС);
				
				ДокументРезультат.Вывести(ОбластьСтрокаАналогов);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Подвал
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	
	Если ТипЗнч(Подписант) = Тип("Структура") Тогда
		СтруктураДанныхКонтактногоЛица = Подписант;
	ИначеЕсли ТипЗнч(Подписант) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(Подписант, Организация);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		СтруктураДанныхКонтактногоЛица = Новый Структура("КонтактноеЛицо, Должность, ОснованиеПолномочий", "_______________", "___________________________");
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ДолжностьПодписанта	= СтруктураДанныхКонтактногоЛица.Должность + ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
	ОбластьПодвал.Параметры.ФИОПодписанта		= СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
	// Настройки печати по умолчанию
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, "ПечатнаяФормаПисьмаСпискаАналогов", Истина, ОриентацияСтраницы.Портрет);
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция СформироватьПечатнуюФормуСпискаАналоговДляСпециализированногоДепозитария(Клиент, Организация, Период, ЦеннаяБумага = Неопределено, СтруктураДанныхПодписанта = Неопределено) Экспорт
	
	СпециализированныйДепозитарий = ПолучитьСпециализированныйДепозитарийКлиента(Клиент, Организация, Период);	
	
	Возврат СформироватьПечатнуюФормуСпискаАналогов(Клиент, Организация, Период, ЦеннаяБумага, СпециализированныйДепозитарий, СтруктураДанныхПодписанта);
	
КонецФункции

Функция ПолучитьСпециализированныйДепозитарийКлиента(Клиент, Организация, Период)
	
	СчетаДоверительногоУправленияКлиента = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(Клиент, Организация, Период);
	
	Возврат ?(СчетаДоверительногоУправленияКлиента.Количество() > 0, СчетаДоверительногоУправленияКлиента[0].СпециализированныйДепозитарий, Неопределено);
	
КонецФункции

#Область Отложенные_задания

Процедура ВыполнитьМетод(Метод, Экземпляры) Экспорт
	
	Если Метод = "ОповеститьОПодобранныхАналогах" Тогда
		ОповеститьОПодобранныхАналогах(Экземпляры);
	КонецЕсли;
	
КонецПроцедуры

// Точка входа отложенного задания: для каждого клиента заново формирует
// печатную форму списка аналогов (на актуальных данных) и передаёт её
// в универсальный механизм рассылки оповещений. Если СформироватьОповещения
// не выполнится (например, из-за сетевой ошибки при отправке письма),
// исключение перехватывается, выполнение задания не фиксируется — оно
// останется в состоянии "Выполняется" и будет пересоздано по истечении таймаута.
Процедура ОповеститьОПодобранныхАналогах(Экземпляры)
	
	Для Каждого ТекЭкземпляр Из Экземпляры Цикл
		
		Попытка
			
			Клиент		= ТекЭкземпляр.Параметры.Клиент;
			Организация	= ТекЭкземпляр.Параметры.Организация;
			Дата		= ТекЭкземпляр.Параметры.Дата;
			
			СпециализированныйДепозитарий = ПолучитьСпециализированныйДепозитарийКлиента(Клиент, Организация, Дата);
			
			Если СпециализированныйДепозитарий = Неопределено Тогда
				ЮрЛицоДепозитария = Неопределено;
			Иначе
				ЮрЛицоДепозитария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпециализированныйДепозитарий, "ЮрФизЛицо");
			КонецЕсли;
			
			Подписант = РаботаСОтчетами.ПолучитьПодписантаПоУмолчанию(Справочники.Отчеты.БэкОфис, Организация);
			
			ПечатнаяФорма = СформироватьПечатнуюФормуСпискаАналогов(Клиент, Организация, Дата, , ЮрЛицоДепозитария, Подписант);
			
			ФорматФайла	= "docx";
			ДатаСтрокой	= Формат(Дата, "ДФ=dd.MM.yyyy");
			ИмяФайла	= СтрШаблон("Аналоги %1.%2", ДатаСтрокой, ФорматФайла);
			
			ПотокВПамяти = Новый ПотокВПамяти();
			ПечатнаяФорма.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента[ФорматФайла]);
			ДвоичныеДанныеФайла = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
			
			Вложения = Новый Соответствие;
			Вложения.Вставить(ИмяФайла, ДвоичныеДанныеФайла);
			
			РеквизитыОповещения = Новый Структура;
			РеквизитыОповещения.Вставить("Клиент",		Клиент);
			РеквизитыОповещения.Вставить("Организация",	Организация);
			РеквизитыОповещения.Вставить("Дата",		Дата);
			РеквизитыОповещения.Вставить("ДатаСтрокой",	ДатаСтрокой);
			РеквизитыОповещения.Вставить("Получатель",	ЮрЛицоДепозитария);
			РеквизитыОповещения.Вставить("Вложения",	Вложения);
			
			Справочники.Оповещения.СформироватьОповещения(
				"Обработка.ПечатьСпискаАналогичныхЦенныхБумаг",
				Перечисления.ТипыСобытий.ВнешнийВызов,
				РеквизитыОповещения);
			
			РаботаСРегламентнымиЗаданиями.ЗафиксироватьВыполнениеОтложенногоЗадания(ТекЭкземпляр.Идентификатор);
			
		Исключение
			
			// Не фиксируем выполнение: задание останется в состоянии "Выполняется"
			// и будет пересоздано по истечении таймаута.
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
